#5.	Пользователь вводит две буквы. Определить, на каких местах
# алфавита они стоят, и сколько между ними находится букв.

a = ord(input("Введите букву латинского алфавита: "))
b = ord(input("Введите ещё одну: "))
a = a - ord('a') + 1
b = b - ord('a') + 1

print("Место в алфавите для первой буквы: ", a)
print("Место в алфавите для второй буквы: ", b)
print("Букв между ними: ", abs(a - b) - 1)