"""
2.	Во втором массиве сохранить индексы четных элементов первого массива.
Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив
надо заполнить значениями 1, 4, 5, 6
(или 0, 3, 4, 5 - если индексация начинается с нуля),
т.к. именно в этих позициях первого массива стоят четные числа.
"""

import random

k = 0
array = []
array_even = []

for i in range(0, 10):
    array.append(random.randint(1, 20))

for i in array:
    if i % 2 == 0:
        array_even.append(k)
    k += 1

print(array)
print(array_even) 